js permanent state ch v2
